详情结果/原始结果/scylla3_runB.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:cassandra-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/cassandra/conf:/home/YCSB/cassandra/target/cassandra-binding-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/io/dropwizard/metrics/metrics-core/3.1.2/metrics-core-3.1.2.jar:/root/.m2/repository/com/datastax/cassandra/cassandra-driver-core/3.0.0/cassandra-driver-core-3.0.0.jar:/root/.m2/repository/io/netty/netty-handler/4.0.33.Final/netty-handler-4.0.33.Final.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/root/.m2/repository/io/netty/netty-transport/4.0.33.Final/netty-transport-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-codec/4.0.33.Final/netty-codec-4.0.33.Final.jar:/root/.m2/repository/com/google/guava/guava/16.0.1/guava-16.0.1.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/io/netty/netty-buffer/4.0.33.Final/netty-buffer-4.0.33.Final.jar:/root/.m2/repository/io/netty/netty-common/4.0.33.Final/netty-common-4.0.33.Final.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadb -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
Command line: -db com.yahoo.ycsb.db.CassandraCQLClient -s -P workloads/workloadb -p hosts=192.168.4.134 -p port=9042 -p cassandra.keyspace=ycsb -p cassandra.username=cassandra -p cassandra.password=cassandra -threads 100 -t
YCSB Client 0.15.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2018-12-29 14:06:06:432 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-29 14:06:16:399 10 sec: 94239 operations; 9423.9 current ops/sec; est completion in 17 minutes [READ: Count=89445, Max=124415, Min=2514, Avg=10080.44, 90=13399, 99=25551, 99.9=95359, 99.99=121023] [UPDATE: Count=4817, Max=112447, Min=4072, Avg=9301.76, 90=11223, 99=13903, 99.9=28767, 99.99=112447] 
2018-12-29 14:06:26:399 20 sec: 197020 operations; 10278.1 current ops/sec; est completion in 16 minutes [READ: Count=97614, Max=39647, Min=3094, Avg=9759.82, 90=12695, 99=24671, 99.9=29887, 99.99=34207] [UPDATE: Count=5160, Max=20287, Min=4456, Avg=9140.3, 90=11111, 99=13375, 99.9=16415, 99.99=19503] 
2018-12-29 14:06:36:398 30 sec: 301934 operations; 10491.4 current ops/sec; est completion in 16 minutes [READ: Count=99575, Max=37919, Min=1708, Avg=9559.62, 90=12471, 99=24271, 99.9=29519, 99.99=34271] [UPDATE: Count=5323, Max=16351, Min=3674, Avg=8964.27, 90=11015, 99=13319, 99.9=14775, 99.99=15935] 
2018-12-29 14:06:46:398 40 sec: 403689 operations; 10175.5 current ops/sec; est completion in 15 minutes [READ: Count=96719, Max=157695, Min=707, Avg=9862.46, 90=12999, 99=25439, 99.9=73535, 99.99=143871] [UPDATE: Count=5045, Max=17823, Min=660, Avg=9093.16, 90=11215, 99=13719, 99.9=16167, 99.99=16943] 
2018-12-29 14:06:56:398 50 sec: 508096 operations; 10440.7 current ops/sec; est completion in 15 minutes [READ: Count=99336, Max=38495, Min=1486, Avg=9600.39, 90=12471, 99=24095, 99.9=29695, 99.99=34495] [UPDATE: Count=5063, Max=17647, Min=2494, Avg=9103.96, 90=11159, 99=14111, 99.9=15767, 99.99=17343] 
2018-12-29 14:07:06:398 60 sec: 612344 operations; 10424.8 current ops/sec; est completion in 15 minutes [READ: Count=98944, Max=37791, Min=2986, Avg=9616.07, 90=12439, 99=24383, 99.9=29311, 99.99=33023] [UPDATE: Count=5306, Max=15559, Min=4372, Avg=9104.57, 90=11135, 99=13151, 99.9=14487, 99.99=14983] 
2018-12-29 14:07:16:398 70 sec: 717058 operations; 10471.4 current ops/sec; est completion in 15 minutes [READ: Count=99454, Max=43519, Min=3142, Avg=9572.77, 90=12255, 99=24207, 99.9=29647, 99.99=35167] [UPDATE: Count=5257, Max=15583, Min=3708, Avg=9109.02, 90=11111, 99=13335, 99.9=14959, 99.99=15447] 
2018-12-29 14:07:26:398 80 sec: 821796 operations; 10473.8 current ops/sec; est completion in 14 minutes [READ: Count=99463, Max=39935, Min=3182, Avg=9567.73, 90=12247, 99=24047, 99.9=29327, 99.99=34527] [UPDATE: Count=5285, Max=15263, Min=4776, Avg=9134.25, 90=11167, 99=13415, 99.9=14711, 99.99=15223] 
2018-12-29 14:07:36:398 90 sec: 926997 operations; 10520.1 current ops/sec; est completion in 14 minutes [READ: Count=99840, Max=46271, Min=2546, Avg=9525.99, 90=12199, 99=23919, 99.9=29631, 99.99=34463] [UPDATE: Count=5362, Max=17343, Min=3522, Avg=9102.94, 90=11111, 99=13639, 99.9=15871, 99.99=16927] 
2018-12-29 14:07:46:398 100 sec: 1031534 operations; 10453.7 current ops/sec; est completion in 14 minutes [READ: Count=99186, Max=38239, Min=2994, Avg=9586.38, 90=12159, 99=23871, 99.9=29103, 99.99=34847] [UPDATE: Count=5349, Max=18735, Min=4620, Avg=9151.2, 90=11039, 99=13207, 99.9=15007, 99.99=16623] 
2018-12-29 14:07:56:398 110 sec: 1135220 operations; 10368.6 current ops/sec; est completion in 14 minutes [READ: Count=98485, Max=42399, Min=3316, Avg=9662.99, 90=12439, 99=24287, 99.9=29727, 99.99=34687] [UPDATE: Count=5199, Max=17647, Min=4624, Avg=9251.77, 90=11375, 99=14215, 99.9=16383, 99.99=17247] 
2018-12-29 14:08:06:398 120 sec: 1241007 operations; 10578.7 current ops/sec; est completion in 14 minutes [READ: Count=100464, Max=41727, Min=3150, Avg=9471.4, 90=12039, 99=23743, 99.9=28815, 99.99=33919] [UPDATE: Count=5325, Max=19263, Min=4520, Avg=9071.85, 90=11015, 99=13463, 99.9=15671, 99.99=18943] 
2018-12-29 14:08:16:398 130 sec: 1346664 operations; 10565.7 current ops/sec; est completion in 13 minutes [READ: Count=100369, Max=37183, Min=3242, Avg=9484.92, 90=12287, 99=24207, 99.9=29679, 99.99=34623] [UPDATE: Count=5282, Max=17087, Min=4200, Avg=9045.37, 90=11159, 99=13655, 99.9=15527, 99.99=17055] 
2018-12-29 14:08:26:398 140 sec: 1452246 operations; 10558.2 current ops/sec; est completion in 13 minutes [READ: Count=100361, Max=40927, Min=3026, Avg=9487.14, 90=12199, 99=23903, 99.9=29231, 99.99=33631] [UPDATE: Count=5219, Max=16359, Min=4112, Avg=9151.29, 90=11215, 99=13759, 99.9=15903, 99.99=16255] 
2018-12-29 14:08:36:398 150 sec: 1556524 operations; 10427.8 current ops/sec; est completion in 13 minutes [READ: Count=99044, Max=40191, Min=2972, Avg=9606.92, 90=12375, 99=23999, 99.9=29375, 99.99=34687] [UPDATE: Count=5238, Max=18063, Min=4236, Avg=9223.74, 90=11343, 99=14087, 99.9=16751, 99.99=17887] 
2018-12-29 14:08:46:398 160 sec: 1661540 operations; 10501.6 current ops/sec; est completion in 13 minutes [READ: Count=99753, Max=45631, Min=2656, Avg=9538.72, 90=12271, 99=24143, 99.9=29871, 99.99=35743] [UPDATE: Count=5260, Max=17167, Min=4724, Avg=9169.5, 90=11335, 99=13463, 99.9=15343, 99.99=16895] 
2018-12-29 14:08:56:398 170 sec: 1766096 operations; 10455.6 current ops/sec; est completion in 13 minutes [READ: Count=99379, Max=38239, Min=2092, Avg=9581.31, 90=12199, 99=23887, 99.9=29087, 99.99=33407] [UPDATE: Count=5175, Max=17103, Min=3982, Avg=9191.98, 90=11191, 99=13231, 99.9=14719, 99.99=15695] 
2018-12-29 14:09:06:398 180 sec: 1872486 operations; 10639 current ops/sec; est completion in 13 minutes [READ: Count=101191, Max=41823, Min=2894, Avg=9418.14, 90=12087, 99=23743, 99.9=29327, 99.99=35103] [UPDATE: Count=5207, Max=17535, Min=4068, Avg=9016.78, 90=11031, 99=13367, 99.9=15791, 99.99=17023] 
2018-12-29 14:09:16:398 190 sec: 1976399 operations; 10391.3 current ops/sec; est completion in 12 minutes [READ: Count=98622, Max=109759, Min=607, Avg=9647.06, 90=12351, 99=24207, 99.9=50815, 99.99=100927] [UPDATE: Count=5286, Max=18287, Min=715, Avg=9144.6, 90=11199, 99=13727, 99.9=15815, 99.99=17039] 
2018-12-29 14:09:26:398 200 sec: 2082027 operations; 10562.8 current ops/sec; est completion in 12 minutes [READ: Count=100411, Max=38655, Min=2690, Avg=9488.37, 90=12223, 99=24031, 99.9=29615, 99.99=34431] [UPDATE: Count=5215, Max=16991, Min=3940, Avg=9072.53, 90=11151, 99=13591, 99.9=16055, 99.99=16911] 
2018-12-29 14:09:36:398 210 sec: 2186506 operations; 10447.9 current ops/sec; est completion in 12 minutes [READ: Count=99279, Max=38815, Min=3608, Avg=9586.88, 90=12199, 99=23791, 99.9=29039, 99.99=34175] [UPDATE: Count=5200, Max=21055, Min=4016, Avg=9195.17, 90=11143, 99=13527, 99.9=15943, 99.99=18383] 
2018-12-29 14:09:46:398 220 sec: 2292650 operations; 10614.4 current ops/sec; est completion in 12 minutes [READ: Count=100830, Max=41855, Min=2844, Avg=9431.84, 90=12047, 99=23599, 99.9=29295, 99.99=34367] [UPDATE: Count=5317, Max=17135, Min=3180, Avg=9175.17, 90=11255, 99=13711, 99.9=15831, 99.99=16335] 
2018-12-29 14:09:56:398 230 sec: 2398960 operations; 10631 current ops/sec; est completion in 12 minutes [READ: Count=100916, Max=38367, Min=2942, Avg=9422.88, 90=11999, 99=23727, 99.9=29071, 99.99=32895] [UPDATE: Count=5399, Max=16287, Min=4888, Avg=9082.44, 90=11071, 99=13183, 99.9=14647, 99.99=14839] 
2018-12-29 14:10:06:398 240 sec: 2504416 operations; 10545.6 current ops/sec; est completion in 11 minutes [READ: Count=100290, Max=37695, Min=3366, Avg=9500.82, 90=12031, 99=23967, 99.9=28831, 99.99=33663] [UPDATE: Count=5163, Max=17311, Min=3868, Avg=9091.3, 90=11055, 99=13263, 99.9=14759, 99.99=16295] 
2018-12-29 14:10:16:398 250 sec: 2608690 operations; 10427.4 current ops/sec; est completion in 11 minutes [READ: Count=98950, Max=39647, Min=3016, Avg=9605.74, 90=12279, 99=24047, 99.9=29535, 99.99=34943] [UPDATE: Count=5318, Max=16879, Min=3918, Avg=9273.68, 90=11343, 99=13679, 99.9=15831, 99.99=16815] 
2018-12-29 14:10:26:398 260 sec: 2713489 operations; 10479.9 current ops/sec; est completion in 11 minutes [READ: Count=99516, Max=36255, Min=3404, Avg=9557.44, 90=12191, 99=23839, 99.9=29375, 99.99=34687] [UPDATE: Count=5285, Max=19359, Min=4980, Avg=9248.58, 90=11263, 99=14111, 99.9=16879, 99.99=19071] 
2018-12-29 14:10:36:398 270 sec: 2818272 operations; 10478.3 current ops/sec; est completion in 11 minutes [READ: Count=99512, Max=41343, Min=3444, Avg=9556.11, 90=12279, 99=23983, 99.9=30223, 99.99=35839] [UPDATE: Count=5276, Max=19775, Min=4892, Avg=9268.22, 90=11495, 99=13839, 99.9=16183, 99.99=17503] 
2018-12-29 14:10:46:398 280 sec: 2924910 operations; 10663.8 current ops/sec; est completion in 11 minutes [READ: Count=101351, Max=39295, Min=2844, Avg=9392.09, 90=12215, 99=23503, 99.9=29423, 99.99=34655] [UPDATE: Count=5281, Max=18143, Min=3804, Avg=9046.41, 90=11175, 99=13775, 99.9=16063, 99.99=16767] 
2018-12-29 14:10:56:398 290 sec: 3030640 operations; 10573 current ops/sec; est completion in 11 minutes [READ: Count=100397, Max=41247, Min=2788, Avg=9475.6, 90=12047, 99=23791, 99.9=29039, 99.99=33695] [UPDATE: Count=5333, Max=16143, Min=3866, Avg=9101.03, 90=11031, 99=13231, 99.9=14887, 99.99=15343] 
2018-12-29 14:11:06:398 300 sec: 3137201 operations; 10656.1 current ops/sec; est completion in 10 minutes [READ: Count=101148, Max=42111, Min=3160, Avg=9401.08, 90=12071, 99=23583, 99.9=29839, 99.99=34367] [UPDATE: Count=5414, Max=16479, Min=4384, Avg=9049.29, 90=11111, 99=13607, 99.9=15279, 99.99=16087] 
2018-12-29 14:11:16:398 310 sec: 3243475 operations; 10627.4 current ops/sec; est completion in 10 minutes [READ: Count=100919, Max=147967, Min=539, Avg=9429.72, 90=12015, 99=23967, 99.9=58879, 99.99=117311] [UPDATE: Count=5362, Max=18351, Min=891, Avg=9009.22, 90=11087, 99=13191, 99.9=15055, 99.99=16703] 
2018-12-29 14:11:26:398 320 sec: 3348943 operations; 10546.8 current ops/sec; est completion in 10 minutes [READ: Count=100181, Max=40063, Min=3212, Avg=9495.91, 90=12175, 99=23695, 99.9=29551, 99.99=33503] [UPDATE: Count=5280, Max=17215, Min=4080, Avg=9162.55, 90=11351, 99=14111, 99.9=16143, 99.99=16767] 
2018-12-29 14:11:36:398 330 sec: 3455883 operations; 10694 current ops/sec; est completion in 10 minutes [READ: Count=101541, Max=39231, Min=2760, Avg=9365.6, 90=11935, 99=23439, 99.9=28623, 99.99=35167] [UPDATE: Count=5401, Max=19103, Min=4172, Avg=9050.8, 90=11071, 99=13519, 99.9=16383, 99.99=18783] 
2018-12-29 14:11:46:398 340 sec: 3561331 operations; 10544.8 current ops/sec; est completion in 10 minutes [READ: Count=100207, Max=39455, Min=3362, Avg=9497.67, 90=12023, 99=23807, 99.9=29183, 99.99=34079] [UPDATE: Count=5238, Max=17999, Min=4252, Avg=9151.7, 90=11151, 99=13439, 99.9=15615, 99.99=17887] 
2018-12-29 14:11:56:398 350 sec: 3665848 operations; 10451.7 current ops/sec; est completion in 10 minutes [READ: Count=99367, Max=39935, Min=3528, Avg=9580.16, 90=12287, 99=23951, 99.9=29407, 99.99=34495] [UPDATE: Count=5151, Max=17343, Min=4480, Avg=9320.77, 90=11431, 99=14103, 99.9=15807, 99.99=16991] 
2018-12-29 14:12:06:398 360 sec: 3771692 operations; 10584.4 current ops/sec; est completion in 9 minutes [READ: Count=100645, Max=37727, Min=2954, Avg=9464.36, 90=12127, 99=23695, 99.9=28879, 99.99=33471] [UPDATE: Count=5197, Max=15719, Min=3990, Avg=9129.01, 90=11175, 99=13583, 99.9=14847, 99.99=15423] 
2018-12-29 14:12:16:398 370 sec: 3877590 operations; 10589.8 current ops/sec; est completion in 9 minutes [READ: Count=100541, Max=36991, Min=3094, Avg=9450.71, 90=11983, 99=23935, 99.9=29919, 99.99=33503] [UPDATE: Count=5366, Max=17359, Min=4276, Avg=9208.84, 90=11335, 99=13431, 99.9=14847, 99.99=15783] 
2018-12-29 14:12:26:398 380 sec: 3983655 operations; 10606.5 current ops/sec; est completion in 9 minutes [READ: Count=100706, Max=40639, Min=2762, Avg=9438.51, 90=12023, 99=23551, 99.9=28927, 99.99=34015] [UPDATE: Count=5357, Max=16399, Min=4748, Avg=9192.26, 90=11191, 99=13335, 99.9=14991, 99.99=15663] 
2018-12-29 14:12:36:398 390 sec: 4088181 operations; 10452.6 current ops/sec; est completion in 9 minutes [READ: Count=99244, Max=44671, Min=3020, Avg=9579.15, 90=12215, 99=23919, 99.9=29423, 99.99=34175] [UPDATE: Count=5283, Max=18831, Min=4544, Avg=9327.23, 90=11471, 99=13967, 99.9=16783, 99.99=17951] 
2018-12-29 14:12:46:398 400 sec: 4192897 operations; 10471.6 current ops/sec; est completion in 9 minutes [READ: Count=99454, Max=36735, Min=3028, Avg=9562.87, 90=12263, 99=23983, 99.9=29423, 99.99=33695] [UPDATE: Count=5260, Max=17423, Min=4468, Avg=9305.96, 90=11479, 99=13983, 99.9=16287, 99.99=17407] 
2018-12-29 14:12:56:398 410 sec: 4300079 operations; 10718.2 current ops/sec; est completion in 9 minutes [READ: Count=101761, Max=39743, Min=3346, Avg=9343, 90=11895, 99=23455, 99.9=28351, 99.99=33375] [UPDATE: Count=5419, Max=18975, Min=4472, Avg=9055.71, 90=11135, 99=13567, 99.9=15295, 99.99=18063] 
2018-12-29 14:13:06:398 420 sec: 4406339 operations; 10626 current ops/sec; est completion in 8 minutes [READ: Count=100823, Max=40543, Min=3336, Avg=9422.51, 90=11919, 99=23295, 99.9=28543, 99.99=32495] [UPDATE: Count=5437, Max=16399, Min=4528, Avg=9162.58, 90=11199, 99=13735, 99.9=15751, 99.99=16375] 
2018-12-29 14:13:16:398 430 sec: 4512450 operations; 10611.1 current ops/sec; est completion in 8 minutes [READ: Count=100887, Max=36511, Min=3054, Avg=9437.44, 90=11927, 99=23535, 99.9=28831, 99.99=33567] [UPDATE: Count=5221, Max=16655, Min=4564, Avg=9139.43, 90=11143, 99=13439, 99.9=15663, 99.99=16543] 
2018-12-29 14:13:26:398 440 sec: 4616517 operations; 10406.7 current ops/sec; est completion in 8 minutes [READ: Count=98878, Max=37791, Min=3350, Avg=9622.46, 90=12215, 99=24095, 99.9=29487, 99.99=34431] [UPDATE: Count=5189, Max=16135, Min=3904, Avg=9303.46, 90=11343, 99=13663, 99.9=15295, 99.99=16111] 
2018-12-29 14:13:36:398 450 sec: 4722851 operations; 10633.4 current ops/sec; est completion in 8 minutes [READ: Count=101057, Max=40671, Min=2406, Avg=9416.92, 90=12207, 99=23599, 99.9=29583, 99.99=33471] [UPDATE: Count=5277, Max=17423, Min=3518, Avg=9120.28, 90=11255, 99=13831, 99.9=15375, 99.99=17295] 
2018-12-29 14:13:46:398 460 sec: 4826924 operations; 10407.3 current ops/sec; est completion in 8 minutes [READ: Count=98820, Max=106815, Min=737, Avg=9625.16, 90=12367, 99=24399, 99.9=43231, 99.99=81855] [UPDATE: Count=5252, Max=16239, Min=984, Avg=9297.21, 90=11471, 99=13807, 99.9=15735, 99.99=16223] 
2018-12-29 14:13:56:398 470 sec: 4930706 operations; 10378.2 current ops/sec; est completion in 8 minutes [READ: Count=98686, Max=39903, Min=3318, Avg=9645.41, 90=12247, 99=23967, 99.9=29455, 99.99=34431] [UPDATE: Count=5099, Max=16703, Min=4576, Avg=9392.13, 90=11567, 99=13839, 99.9=15103, 99.99=16247] 
2018-12-29 14:14:06:398 480 sec: 5036451 operations; 10574.5 current ops/sec; est completion in 7 minutes [READ: Count=100345, Max=39519, Min=2930, Avg=9467.97, 90=12015, 99=23535, 99.9=28895, 99.99=32991] [UPDATE: Count=5401, Max=18111, Min=4704, Avg=9210.94, 90=11183, 99=13463, 99.9=15551, 99.99=16735] 
2018-12-29 14:14:16:398 490 sec: 5141358 operations; 10490.7 current ops/sec; est completion in 7 minutes [READ: Count=99679, Max=51007, Min=2994, Avg=9541.28, 90=12159, 99=23775, 99.9=29343, 99.99=39167] [UPDATE: Count=5233, Max=27919, Min=4936, Avg=9319.75, 90=11423, 99=13999, 99.9=18319, 99.99=27487] 
2018-12-29 14:14:26:398 500 sec: 5246110 operations; 10475.2 current ops/sec; est completion in 7 minutes [READ: Count=99516, Max=36511, Min=3674, Avg=9560.59, 90=12119, 99=23855, 99.9=29087, 99.99=33343] [UPDATE: Count=5229, Max=16895, Min=4568, Avg=9251.63, 90=11375, 99=13407, 99.9=15519, 99.99=16447] 
2018-12-29 14:14:36:398 510 sec: 5351842 operations; 10573.2 current ops/sec; est completion in 7 minutes [READ: Count=100399, Max=40607, Min=3494, Avg=9470.24, 90=11983, 99=23727, 99.9=28751, 99.99=33311] [UPDATE: Count=5333, Max=16023, Min=3868, Avg=9218.12, 90=11303, 99=13471, 99.9=14983, 99.99=15911] 
2018-12-29 14:14:46:398 520 sec: 5457323 operations; 10548.1 current ops/sec; est completion in 7 minutes [READ: Count=100343, Max=40191, Min=3364, Avg=9491.65, 90=12031, 99=23423, 99.9=29007, 99.99=33663] [UPDATE: Count=5142, Max=17663, Min=4896, Avg=9207.9, 90=11207, 99=13663, 99.9=15767, 99.99=16719] 
2018-12-29 14:14:56:398 530 sec: 5561166 operations; 10384.3 current ops/sec; est completion in 7 minutes [READ: Count=98693, Max=38591, Min=3062, Avg=9646.04, 90=12287, 99=24191, 99.9=29503, 99.99=34687] [UPDATE: Count=5146, Max=17455, Min=4800, Avg=9305.11, 90=11455, 99=14471, 99.9=16207, 99.99=17295] 
2018-12-29 14:15:06:398 540 sec: 5666282 operations; 10511.6 current ops/sec; est completion in 6 minutes [READ: Count=99834, Max=102847, Min=2112, Avg=9530.04, 90=12095, 99=23935, 99.9=34015, 99.99=89919] [UPDATE: Count=5280, Max=17631, Min=3128, Avg=9187.9, 90=11191, 99=13263, 99.9=15543, 99.99=16215] 
2018-12-29 14:15:16:398 550 sec: 5771878 operations; 10559.6 current ops/sec; est completion in 6 minutes [READ: Count=100373, Max=40959, Min=3372, Avg=9479.53, 90=12063, 99=23535, 99.9=29007, 99.99=33983] [UPDATE: Count=5229, Max=17375, Min=5176, Avg=9216.58, 90=11247, 99=13551, 99.9=16119, 99.99=17375] 
2018-12-29 14:15:26:398 560 sec: 5877074 operations; 10519.6 current ops/sec; est completion in 6 minutes [READ: Count=99941, Max=37919, Min=3454, Avg=9517.64, 90=12087, 99=23679, 99.9=28671, 99.99=32927] [UPDATE: Count=5258, Max=17391, Min=5204, Avg=9270.16, 90=11383, 99=13639, 99.9=15935, 99.99=16639] 
2018-12-29 14:15:36:399 570 sec: 5981852 operations; 10477.8 current ops/sec; est completion in 6 minutes [READ: Count=99555, Max=41759, Min=3000, Avg=9555.12, 90=12039, 99=23567, 99.9=29087, 99.99=34143] [UPDATE: Count=5223, Max=20927, Min=4776, Avg=9291.36, 90=11239, 99=13463, 99.9=16151, 99.99=17679] 
2018-12-29 14:15:46:398 580 sec: 6088650 operations; 10679.8 current ops/sec; est completion in 6 minutes [READ: Count=101392, Max=40159, Min=1598, Avg=9372.3, 90=11887, 99=23279, 99.9=28655, 99.99=33311] [UPDATE: Count=5399, Max=17439, Min=1614, Avg=9147.83, 90=11199, 99=13527, 99.9=16191, 99.99=16575] 
2018-12-29 14:15:56:398 590 sec: 6194312 operations; 10566.2 current ops/sec; est completion in 6 minutes [READ: Count=100427, Max=37823, Min=3406, Avg=9475.5, 90=11975, 99=23599, 99.9=29023, 99.99=34239] [UPDATE: Count=5234, Max=17759, Min=4392, Avg=9245.88, 90=11255, 99=13567, 99.9=15743, 99.99=16799] 
2018-12-29 14:16:06:398 600 sec: 6303049 operations; 10873.7 current ops/sec; est completion in 5 minutes [READ: Count=103381, Max=38335, Min=2802, Avg=9202.46, 90=11887, 99=22959, 99.9=28319, 99.99=33439] [UPDATE: Count=5358, Max=17711, Min=4236, Avg=9035.42, 90=11175, 99=13735, 99.9=16063, 99.99=16687] 
2018-12-29 14:16:16:398 610 sec: 6411724 operations; 10867.5 current ops/sec; est completion in 5 minutes [READ: Count=103154, Max=35903, Min=2968, Avg=9208.22, 90=11895, 99=23007, 99.9=28687, 99.99=33023] [UPDATE: Count=5518, Max=17359, Min=4188, Avg=9036.76, 90=11199, 99=13727, 99.9=15391, 99.99=16783] 
2018-12-29 14:16:26:398 620 sec: 6518358 operations; 10663.4 current ops/sec; est completion in 5 minutes [READ: Count=101358, Max=40607, Min=2992, Avg=9384.27, 90=12023, 99=23375, 99.9=28911, 99.99=33439] [UPDATE: Count=5279, Max=17519, Min=3920, Avg=9203.09, 90=11383, 99=14031, 99.9=15799, 99.99=17423] 
2018-12-29 14:16:36:399 630 sec: 6627236 operations; 10887.8 current ops/sec; est completion in 5 minutes [READ: Count=103490, Max=37663, Min=2698, Avg=9192.73, 90=11919, 99=22815, 99.9=28735, 99.99=33855] [UPDATE: Count=5387, Max=18975, Min=3524, Avg=9048.41, 90=11343, 99=14279, 99.9=16591, 99.99=17935] 
2018-12-29 14:16:46:399 640 sec: 6733856 operations; 10662 current ops/sec; est completion in 5 minutes [READ: Count=101215, Max=40319, Min=3094, Avg=9391.35, 90=12167, 99=23407, 99.9=29311, 99.99=33247] [UPDATE: Count=5404, Max=20303, Min=4264, Avg=9105.85, 90=11327, 99=14255, 99.9=16815, 99.99=19775] 
2018-12-29 14:16:56:398 650 sec: 6841852 operations; 10799.6 current ops/sec; est completion in 5 minutes [READ: Count=102612, Max=38015, Min=2782, Avg=9264.77, 90=11959, 99=23151, 99.9=28751, 99.99=33311] [UPDATE: Count=5383, Max=17311, Min=4364, Avg=9122.61, 90=11215, 99=13887, 99.9=15903, 99.99=17071] 
2018-12-29 14:17:06:398 660 sec: 6948635 operations; 10678.3 current ops/sec; est completion in 4 minutes [READ: Count=101559, Max=37311, Min=3182, Avg=9373.59, 90=11935, 99=23311, 99.9=28639, 99.99=32303] [UPDATE: Count=5232, Max=17375, Min=3930, Avg=9120.76, 90=11103, 99=13647, 99.9=15967, 99.99=16895] 
2018-12-29 14:17:16:398 670 sec: 7054019 operations; 10538.4 current ops/sec; est completion in 4 minutes [READ: Count=100124, Max=39007, Min=2802, Avg=9500.49, 90=12079, 99=23583, 99.9=29167, 99.99=33823] [UPDATE: Count=5255, Max=17487, Min=4876, Avg=9275.94, 90=11375, 99=13919, 99.9=15791, 99.99=16575] 
2018-12-29 14:17:26:398 680 sec: 7158671 operations; 10465.2 current ops/sec; est completion in 4 minutes [READ: Count=99352, Max=48799, Min=3078, Avg=9564.22, 90=12047, 99=23663, 99.9=28927, 99.99=33855] [UPDATE: Count=5297, Max=17215, Min=4664, Avg=9383.26, 90=11479, 99=13679, 99.9=15319, 99.99=16359] 
2018-12-29 14:17:36:398 690 sec: 7264278 operations; 10560.7 current ops/sec; est completion in 4 minutes [READ: Count=100416, Max=35935, Min=2628, Avg=9482.05, 90=11999, 99=23407, 99.9=28783, 99.99=32527] [UPDATE: Count=5191, Max=16327, Min=4588, Avg=9195.71, 90=11183, 99=13487, 99.9=15271, 99.99=16087] 
2018-12-29 14:17:46:398 700 sec: 7370957 operations; 10667.9 current ops/sec; est completion in 4 minutes [READ: Count=101418, Max=41023, Min=1971, Avg=9380.64, 90=11935, 99=23343, 99.9=29407, 99.99=33503] [UPDATE: Count=5263, Max=17247, Min=2960, Avg=9183.92, 90=11303, 99=13895, 99.9=16119, 99.99=16447] 
2018-12-29 14:17:56:398 710 sec: 7475962 operations; 10500.5 current ops/sec; est completion in 4 minutes [READ: Count=99743, Max=38495, Min=2892, Avg=9535.54, 90=12127, 99=23759, 99.9=29055, 99.99=33919] [UPDATE: Count=5263, Max=17455, Min=4026, Avg=9285.73, 90=11319, 99=13879, 99.9=15743, 99.99=17359] 
2018-12-29 14:18:06:398 720 sec: 7582593 operations; 10663.1 current ops/sec; est completion in 3 minutes [READ: Count=101245, Max=38463, Min=3108, Avg=9388.27, 90=11943, 99=23263, 99.9=28767, 99.99=33151] [UPDATE: Count=5386, Max=16199, Min=4236, Avg=9121.86, 90=11175, 99=13367, 99.9=14903, 99.99=15799] 
2018-12-29 14:18:16:398 730 sec: 7688615 operations; 10602.2 current ops/sec; est completion in 3 minutes [READ: Count=100704, Max=105151, Min=1232, Avg=9452.04, 90=12103, 99=23775, 99.9=33695, 99.99=83519] [UPDATE: Count=5315, Max=16319, Min=1453, Avg=9041.01, 90=11063, 99=13327, 99.9=14895, 99.99=15463] 
2018-12-29 14:18:26:398 740 sec: 7795136 operations; 10652.1 current ops/sec; est completion in 3 minutes [READ: Count=101183, Max=38399, Min=3318, Avg=9399.84, 90=12007, 99=23423, 99.9=29151, 99.99=34207] [UPDATE: Count=5338, Max=16447, Min=3776, Avg=9098.18, 90=11119, 99=13263, 99.9=15303, 99.99=16215] 
2018-12-29 14:18:36:398 750 sec: 7902409 operations; 10727.3 current ops/sec; est completion in 3 minutes [READ: Count=101780, Max=36351, Min=3226, Avg=9332.8, 90=11911, 99=23151, 99.9=28639, 99.99=33215] [UPDATE: Count=5496, Max=16207, Min=4372, Avg=9088.56, 90=11047, 99=13247, 99.9=14783, 99.99=16175] 
2018-12-29 14:18:46:398 760 sec: 8009156 operations; 10674.7 current ops/sec; est completion in 3 minutes [READ: Count=101463, Max=39263, Min=3096, Avg=9378.06, 90=11999, 99=23151, 99.9=28399, 99.99=33311] [UPDATE: Count=5289, Max=17823, Min=4540, Avg=9161.25, 90=11223, 99=13527, 99.9=15711, 99.99=17391] 
2018-12-29 14:18:56:398 770 sec: 8113632 operations; 10447.6 current ops/sec; est completion in 3 minutes [READ: Count=99321, Max=39103, Min=3454, Avg=9579.65, 90=12031, 99=23647, 99.9=29135, 99.99=34591] [UPDATE: Count=5155, Max=18207, Min=4888, Avg=9344.26, 90=11391, 99=13463, 99.9=16055, 99.99=17583] 
2018-12-29 14:19:06:398 780 sec: 8221078 operations; 10744.6 current ops/sec; est completion in 2 minutes [READ: Count=102192, Max=36479, Min=3102, Avg=9318.98, 90=11839, 99=23007, 99.9=28591, 99.99=32927] [UPDATE: Count=5246, Max=16119, Min=4532, Avg=9083.59, 90=11111, 99=13359, 99.9=15319, 99.99=15815] 
2018-12-29 14:19:16:398 790 sec: 8327400 operations; 10632.2 current ops/sec; est completion in 2 minutes [READ: Count=101134, Max=37599, Min=2584, Avg=9419.88, 90=11999, 99=23439, 99.9=28671, 99.99=33119] [UPDATE: Count=5189, Max=16831, Min=4256, Avg=9093.99, 90=11223, 99=13479, 99.9=15359, 99.99=16495] 
2018-12-29 14:19:26:398 800 sec: 8434354 operations; 10695.4 current ops/sec; est completion in 2 minutes [READ: Count=101611, Max=37151, Min=3032, Avg=9357.87, 90=11887, 99=23359, 99.9=28783, 99.99=34047] [UPDATE: Count=5342, Max=15743, Min=4276, Avg=9149.8, 90=11127, 99=13447, 99.9=15415, 99.99=15711] 
2018-12-29 14:19:36:398 810 sec: 8541912 operations; 10755.8 current ops/sec; est completion in 2 minutes [READ: Count=102208, Max=39199, Min=3104, Avg=9305.32, 90=11751, 99=23119, 99.9=28799, 99.99=33439] [UPDATE: Count=5352, Max=16511, Min=4184, Avg=9109.44, 90=11159, 99=13159, 99.9=15783, 99.99=16351] 
2018-12-29 14:19:46:398 820 sec: 8648301 operations; 10638.9 current ops/sec; est completion in 2 minutes [READ: Count=101004, Max=38175, Min=3268, Avg=9408.34, 90=12175, 99=23343, 99.9=29183, 99.99=33311] [UPDATE: Count=5383, Max=17343, Min=3396, Avg=9184.24, 90=11463, 99=14111, 99.9=16311, 99.99=16847] 
2018-12-29 14:19:56:398 830 sec: 8753686 operations; 10538.5 current ops/sec; est completion in 1 minute [READ: Count=100176, Max=39071, Min=2740, Avg=9497.67, 90=12295, 99=23743, 99.9=29679, 99.99=35391] [UPDATE: Count=5209, Max=17711, Min=4010, Avg=9326.05, 90=11663, 99=14599, 99.9=16415, 99.99=17695] 
2018-12-29 14:20:06:399 840 sec: 8861712 operations; 10802.6 current ops/sec; est completion in 1 minute [READ: Count=102549, Max=37279, Min=3286, Avg=9260.27, 90=11831, 99=22863, 99.9=28047, 99.99=32863] [UPDATE: Count=5477, Max=18207, Min=4456, Avg=9147.07, 90=11263, 99=13927, 99.9=15967, 99.99=17215] 
2018-12-29 14:20:16:399 850 sec: 8971741 operations; 11002.9 current ops/sec; est completion in 1 minute [READ: Count=104594, Max=36383, Min=2774, Avg=9096.1, 90=11583, 99=22655, 99.9=27999, 99.99=32127] [UPDATE: Count=5440, Max=17567, Min=3268, Avg=8908.93, 90=10967, 99=13399, 99.9=16751, 99.99=17519] 
2018-12-29 14:20:26:398 860 sec: 9080802 operations; 10906.1 current ops/sec; est completion in 1 minute [READ: Count=103688, Max=36767, Min=3206, Avg=9173.19, 90=11719, 99=23039, 99.9=28431, 99.99=32863] [UPDATE: Count=5368, Max=17375, Min=4632, Avg=9032.27, 90=11167, 99=13711, 99.9=15575, 99.99=16119] 
2018-12-29 14:20:36:398 870 sec: 9187754 operations; 10695.2 current ops/sec; est completion in 1 minute [READ: Count=101639, Max=37663, Min=2986, Avg=9359.63, 90=11879, 99=23119, 99.9=28831, 99.99=33183] [UPDATE: Count=5313, Max=18351, Min=3710, Avg=9173.05, 90=11151, 99=13743, 99.9=16359, 99.99=16751] 
2018-12-29 14:20:46:398 880 sec: 9294665 operations; 10691.1 current ops/sec; est completion in 1 minute [READ: Count=101652, Max=41087, Min=2554, Avg=9360.36, 90=12071, 99=23247, 99.9=28927, 99.99=33023] [UPDATE: Count=5259, Max=17391, Min=4676, Avg=9185.78, 90=11447, 99=14311, 99.9=16191, 99.99=16591] 
2018-12-29 14:20:56:398 890 sec: 9398252 operations; 10358.7 current ops/sec; est completion in 57 seconds [READ: Count=98444, Max=39295, Min=3088, Avg=9666.91, 90=12407, 99=24047, 99.9=29759, 99.99=34367] [UPDATE: Count=5143, Max=18879, Min=4014, Avg=9371.9, 90=11567, 99=14383, 99.9=16575, 99.99=18719] 
2018-12-29 14:21:06:398 900 sec: 9504380 operations; 10612.8 current ops/sec; est completion in 47 seconds [READ: Count=100694, Max=139647, Min=645, Avg=9444, 90=11959, 99=23791, 99.9=79295, 99.99=124095] [UPDATE: Count=5435, Max=18975, Min=693, Avg=8994.34, 90=11127, 99=13487, 99.9=15735, 99.99=16719] 
2018-12-29 14:21:16:398 910 sec: 9611640 operations; 10726 current ops/sec; est completion in 37 seconds [READ: Count=101977, Max=37279, Min=3458, Avg=9330.86, 90=11863, 99=23135, 99.9=28655, 99.99=32255] [UPDATE: Count=5282, Max=17711, Min=3784, Avg=9162.21, 90=11151, 99=13751, 99.9=16015, 99.99=16415] 
2018-12-29 14:21:26:398 920 sec: 9719475 operations; 10783.5 current ops/sec; est completion in 27 seconds [READ: Count=102399, Max=37535, Min=3098, Avg=9281.41, 90=11759, 99=23103, 99.9=27727, 99.99=31839] [UPDATE: Count=5440, Max=16303, Min=3348, Avg=9071.21, 90=11071, 99=13287, 99.9=14959, 99.99=15575] 
2018-12-29 14:21:36:398 930 sec: 9827369 operations; 10789.4 current ops/sec; est completion in 17 seconds [READ: Count=102382, Max=39615, Min=2896, Avg=9279.02, 90=11911, 99=23087, 99.9=28607, 99.99=31983] [UPDATE: Count=5513, Max=16383, Min=4040, Avg=9024.61, 90=11127, 99=13559, 99.9=15719, 99.99=16335] 
2018-12-29 14:21:46:398 940 sec: 9934473 operations; 10710.4 current ops/sec; est completion in 7 second [READ: Count=101763, Max=38431, Min=3082, Avg=9344.03, 90=11871, 99=23327, 99.9=29087, 99.99=34591] [UPDATE: Count=5336, Max=17951, Min=4468, Avg=9121.93, 90=11167, 99=13407, 99.9=15879, 99.99=17903] 
2018-12-29 14:21:54:938 948 sec: 10000000 operations; 7672.95 current ops/sec; [READ: Count=62234, Max=37311, Min=425, Avg=8654.48, 90=11687, 99=22991, 99.9=27983, 99.99=32639] [CLEANUP: Count=100, Max=2215935, Min=0, Avg=22150.98, 90=3, 99=68, 99.9=2215935, 99.99=2215935] [UPDATE: Count=3293, Max=17775, Min=457, Avg=8533.17, 90=11159, 99=14159, 99.9=15975, 99.99=17775] 
[OVERALL], RunTime(ms), 948539
[OVERALL], Throughput(ops/sec), 10542.52908947339
[TOTAL_GCS_PS_Scavenge], Count, 617
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1009
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.10637411851278651
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 617
[TOTAL_GC_TIME], Time(ms), 1009
[TOTAL_GC_TIME_%], Time(%), 0.10637411851278651
[READ], Operations, 9499916
[READ], AverageLatency(us), 9465.07554045741
[READ], MinLatency(us), 425
[READ], MaxLatency(us), 157695
[READ], 95thPercentileLatency(us), 15639
[READ], 99thPercentileLatency(us), 23711
[READ], Return=OK, 9499916
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22150.98
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2215935
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 68
[UPDATE], Operations, 500084
[UPDATE], AverageLatency(us), 9157.31068380512
[UPDATE], MinLatency(us), 457
[UPDATE], MaxLatency(us), 112447
[UPDATE], 95thPercentileLatency(us), 12015
[UPDATE], 99thPercentileLatency(us), 13671
[UPDATE], Return=OK, 500084